export default {
  Phone: /^1(3[0-9]|4[57]|5[0-35-9]|7[0135678]|8[0-9]|9[8-9])\d{8}$/, // 电话号码(移动/联通/电信)

  ImageUrl: /^http[s]*:\/\/|\.jpg$|\.png$|\.jpeg$|\.gif$|\.bmp$|\.webp$|^data:image/, // 图片链接

  IDCard: /^(\d{15}$|^\d{18}$|^\d{17}(\d|X|x))$/, // 身份证

  Score: /^(\d(\.\d{1,2})?|10(\.0{1,2})?)$/, // 0-10保留两位小数

  Money: /^(([1-9]\d*)|0)(\.\d{1,2})?$/, // 金额数

  Split: /(?=(?!\b)(\d{3})+$)/, // 每三位以逗号分割 str.replace(re,',')

  Email: /[\w!#$%&'*+/=?^_`{|}~-]+(?:\.[\w!#$%&'*+/=?^_`{|}~-]+)*@(?:[\w](?:[\w-]*[\w])?\.)+[\w](?:[\w-]*[\w])?/,

  Integer: /^-?[1-9]\d*$/, // 整数

  PositiveInteger: /^[1-9]\d*$/, // 正整数

  NegtiveInteger: /^-[1-9]\d*$/, // 负整数

  NonPositiveInteger: /^-[1-9]\d*|0$/, // 非正整数

  NonNegtiveInteger: /^[1-9]\d*|0$/, // 非负整数
};
